ITDiplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧ_ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРаботы</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ITDiplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ITDiplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ITDiplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ITDiplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

ITDiplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ЕжемесячнаяАбоненскаяПлата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтавкаЗаЧас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ITDiplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ObjectModule.bsl
#Область ОбработчикиСобытий

//Добавление процедуры 
//Макаров А.С.
//05.05.2024

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ЭтоНовый() Тогда
		ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	Иначе
		СообщениеПриИзмененнииДанных();
	КонецЕсли;

КонецПроцедуры

//КонецРедактирования
//Макаров А.С.
//05.05.2024

//Добавление процедуры 
//Макаров А.С.
//05.05.2024

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ДополнительныеСвойства.Свойство("ЭтоНовый") Тогда
		СообщениеПриПервойЗаписи();
	КонецЕсли;

КонецПроцедуры

//КонецРедактирования
//Макаров А.С.
//05.05.2024

//Добавление процедуры 
//Макаров А.С.
//05.05.2024

Процедура ОбработкаПроведения(Отказ,Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудников.ПроцентОтРабот, 0) КАК ПроцентОтРабот,
		|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист
		|ПОМЕСТИТЬ ВТ_ПроцентПоСотруднику
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников КАК ВКМ_УсловияОплатыСотрудников
		|		ПО (ВКМ_ОбслуживаниеКлиента.Специалист = ВКМ_УсловияОплатыСотрудников.Сотрудник)
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор,
		|	ДоговорыКонтрагентов.Наименование КАК Наименование,
		|	ДоговорыКонтрагентов.ВКМ_СтавкаЗаЧас КАК ВКМ_СтавкаЗаЧас,
		|	ДоговорыКонтрагентов.ВидДоговора,
		|	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора,
		|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора
		|ПОМЕСТИТЬ ВТ_ДанныеПоДоговору
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО (ВКМ_ОбслуживаниеКлиента.Договор = ДоговорыКонтрагентов.Ссылка)
		|		И (ВКМ_ОбслуживаниеКлиента.Клиент = ДоговорыКонтрагентов.Владелец)
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
		|	И ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот
		|		МЕЖДУ ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВКМ_ОбслуживаниеКлиентаТЧ_ВыполненныеРаботы.ФактическиПотраченоЧасов) КАК ФактическиПотраченоЧасов,
		|	СУММА(ВКМ_ОбслуживаниеКлиентаТЧ_ВыполненныеРаботы.ЧасыКОплатеКлиенту) КАК ЧасыКОплатеКлиенту
		|ПОМЕСТИТЬ ВТ_ТЧЧасовКОплате
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента.ТЧ_ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаТЧ_ВыполненныеРаботы
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентаТЧ_ВыполненныеРаботы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПроцентПоСотруднику.Специалист КАК Сотрудник,
		|	ВТ_ДанныеПоДоговору.Договор КАК Договор,
		|	ВТ_ДанныеПоДоговору.ВКМ_СтавкаЗаЧас КАК СтавкаЗаЧас,
		|	ВТ_ПроцентПоСотруднику.ПроцентОтРабот КАК ПроцентОтРабот,
		|	ВТ_ТЧЧасовКОплате.ЧасыКОплатеКлиенту КАК ЧасыКОплатеКлиенту,
		|	ВТ_ДанныеПоДоговору.ВидДоговора КАК ВидДоговора,
		|	ВТ_ДанныеПоДоговору.ВКМ_ДатаНачалаДействияДоговора КАК ДоговорС,
		|	ВТ_ДанныеПоДоговору.ВКМ_ДатаОкончанияДействияДоговора КАК ДоговорПо
		|ИЗ
		|	ВТ_ДанныеПоДоговору КАК ВТ_ДанныеПоДоговору,
		|	ВТ_ПроцентПоСотруднику КАК ВТ_ПроцентПоСотруднику,
		|	ВТ_ТЧЧасовКОплате КАК ВТ_ТЧЧасовКОплате";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Если ВыборкаДетальныеЗаписи.ВидДоговора = ПредопределенноеЗначение(
			"Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
			Если ВыборкаДетальныеЗаписи.ДоговорС <= Дата И ВыборкаДетальныеЗаписи.ДоговорПо >= Дата Тогда
				
				//ВыполненныеСотрудникомРаботы
				Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
				Движение.ЧасовКОплате = ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту;
				Движение.СуммаКОплате = ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту * ВыборкаДетальныеЗаписи.СтавкаЗаЧас
					* ВыборкаДетальныеЗаписи.ПроцентОтРабот / 100;
				
				//ВыполненныеКлиентуРаботы
				Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
				Движение.Период = Дата;
				Движение.Клиент = Клиент;
				Движение.Договор = Договор;
				Движение.КоличествоЧасов = ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту;
				Движение.СуммаКОплате = ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту * ВыборкаДетальныеЗаписи.СтавкаЗаЧас;
			

			Иначе

				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Недействительный срок действия договора: %1", Договор);
				Сообщение.Сообщить();

			КонецЕсли;

		Иначе

			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Указан неверный вид договора: %1", ВыборкаДетальныеЗаписи.ВидДоговора);
			Сообщение.Сообщить();

		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

//КонецРедактирования
//Макаров А.С.
//05.05.2024



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Добавление процедуры 
//Макаров А.С.
//05.05.2024

Процедура СообщениеПриПервойЗаписи()
 	
 	Сообщение = Справочники.ВКМ_ТекстУведомленияБоту.СоздатьЭлемент();
 	Сообщение.ТекстСообщения = СтрШаблон(
 	"Добрый день. 
 	|Заявка №%1
 	|Клиент: %2 
 	|Специалист: %3 
 	|Дата: %4
 	|Время: с %5 по %6
 	|Описание проблемы: %7", 	
 	Число(Номер), Клиент, Специалист, Формат(ДатаПроведенияРабот,"ДФ='d ММММ';") , 
 	Формат(ВремяНачалаРабот,"ДФ=ЧЧ:мм;") , 
 	Формат(ВремяОкончанияРабот, "ДФ=ЧЧ:мм;"), ОписаниеПроблемы);
 	
 	Сообщение.Записать();
 
КонецПроцедуры

//КонецРедактирования
//Макаров А.С.
//05.05.2024

//Добавление процедуры 
//Макаров А.С.
//05.05.2024

Процедура СообщениеПриИзмененнииДанных()
 		
 	Запрос = Новый Запрос;
 	Запрос.Текст =
 		"ВЫБРАТЬ
 		|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот,
 		|	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРабот,
 		|	ВКМ_ОбслуживаниеКлиента.ВремяОкончанияРабот,
 		|	ВКМ_ОбслуживаниеКлиента.Специалист
 		|ИЗ
 		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
 		|ГДЕ
 		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
 		
 	Запрос.УстановитьПараметр("Ссылка", Ссылка);
 	
 	РезультатЗапроса = Запрос.Выполнить();
 	
 	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
 	
 	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
 		ДатаРабот = ВыборкаДетальныеЗаписи.ДатаПроведенияРабот;
 		ВремяНачала = ВыборкаДетальныеЗаписи.ВремяНачалаРабот;
 		ВремяОкончания = ВыборкаДетальныеЗаписи.ВремяОкончанияРабот;
 		СпециалистВДокументе = ВыборкаДетальныеЗаписи.Специалист;
 	КонецЦикла;
 	
 	ИзмененныеДанные = "";
 	
 	Сообщение = Справочники.ВКМ_ТекстУведомленияБоту.СоздатьЭлемент();
	Сообщение.ТекстСообщения = СтрШаблон(
 	"Добрый день.
	 |Появились изменения по заявке №%1.
	 |Клиент: %2 
	 |Специалист: %3
	 |Дата: %4
	 |Время: с %5 по %6
	 |Описание проблемы: %7", Число(Номер), Клиент, Специалист, Формат(ДатаПроведенияРабот,
		"ДФ='d ММММ';"), Формат(ВремяНачалаРабот, "ДФ=ЧЧ:мм;"), Формат(ВремяОкончанияРабот, "ДФ=ЧЧ:мм;"),
		ОписаниеПроблемы);
 	
 	ИзмененныеДанныеМассив = Новый Массив;
 	
 	Если ДатаРабот <> ДатаПроведенияРабот Тогда

		ЗаменитьСтроку = СтрЗаменить(Сообщение.ТекстСообщения, ДатаПроведенияРабот, ДатаПроведенияРабот);
		ИзмененныеДанныеМассив.Добавить("дата проведения работ");
		
	КонецЕсли;

	Если ВремяНачала <> ВремяНачалаРабот Тогда

		ЗаменитьСтроку = СтрЗаменить(Сообщение.ТекстСообщения, ВремяНачалаРабот, ВремяНачалаРабот);
		ИзмененныеДанныеМассив.Добавить("время начала работ");
		
	КонецЕсли;

	Если ВремяОкончания <> ВремяОкончанияРабот Тогда

		ЗаменитьСтроку = СтрЗаменить(Сообщение.ТекстСообщения, ВремяОкончанияРабот, ВремяОкончанияРабот);
		ИзмененныеДанныеМассив.Добавить("время окончания работ");

	КонецЕсли;

	Если СпециалистВДокументе <> Специалист Тогда

		ЗаменитьСтроку = СтрЗаменить(Сообщение.ТекстСообщения, Специалист, Специалист);
		ИзмененныеДанныеМассив.Добавить("специалист");

	КонецЕсли;
	
	Если ИзмененныеДанныеМассив.Количество() > 0 Тогда
		
		Сообщение.Записать();
		
	КонецЕсли;

КонецПроцедуры

//КонецРедактирования
//Макаров А.С.
//05.05.2024

#КонецОбласти
